sql/URLShortener/app/models/shortened_url.rb

INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "www.chess.com"], ["short_url", "rLvWjAGmd1SKfK+T+zhHow=="], ["user_id", 1], ["created_at", "2021-05-16 22:16:22.474236"], ["updated_at", "2021-05-16 22:16:22.474236"]]
---
    def self.create!(user,long_url_string)
        # random_code()
        # ShortenedUrl.
        newobject=self.new(short_url:random_code(),long_url:long_url_string,user_id:user.id)
        newobject.save!

SELECT 1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "5O/TN5QFm9GTtVy42FEpVA=="], ["LIMIT", 1]]
---
    def self.random_code
    short_url=SecureRandom.base64(16)
    while ShortenedUrl.exists?(short_url:short_url)

DELETE FROM "shortened_urls" WHERE "shortened_urls"."id" = $1  [["id", 124]]
DELETE FROM "visits" WHERE "visits"."id" = $1  [["id", 18]]
SELECT "shortened_urls".* FROM "shortened_urls" LEFT OUTER JOIN "visits" ON "visits"."shortened_url_id" = "shortened_urls"."id" WHERE ((visits.created_at<'2021-05-31 01:15:05 UTC') OR "visits"."id" IS NULL AND (shortened_urls.created_at<'2021-05-31 01:15:05 UTC'))
---
    def self.prune(n)
        # ShortenedUrl.left_outer_joins(:visits).where(visits:{id:nil})

        ShortenedUrl.left_outer_joins(:visits) \
        .where("visits.created_at<'#{n.minutes.ago}'")\
        .or(ShortenedUrl.left_outer_joins(:visits).where(visits:{id:nil}).where("shortened_urls.created_at<'#{n.minutes.ago}'"))\
        .destroy_all