sql/URLShortener/app/models/visit.rb

    def self.record_visit!(user,shortened_url)
        self.create!({user_id:user.id,shortened_url_id:shortened_url.id})
---
INSERT INTO "visits" ("user_id", "shortened_url_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["shortened_url_id", 6], ["created_at", "2021-05-16 23:22:20.400475"], ["updated_at", "2021-05-16 23:22:20.400475"]]